{
  "source": "experience.com/reviews/david-day-388889",
  "count": 78,
  "reviews": [
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Even while sick with the flu, stayed on top of things and communicated all the steps with me."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "was prompt with his communication, prepared to help get our offer accepted & moving forward quickly and attentive to details. He had the loan ready to close early with no interruptions. Couldn't have asked for a smoother transaction working"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "was extremely professional. Everything went very smooth and answered all of my questions."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "multiple times and his professionalism deserves recognition! I'm happy to recommend him to any of"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Fast, friendly, made sure if there wete any issues, they were handled immediately"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "constantly updated me through the whole process. I was never blindsided nor disappointed with his performance. I would highly recommend for any of your mortgage sheets."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "The entire process. Communication and step by step involvement. All requests were taken care of. He was available 24/7"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "How he took time to explain things to us."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "went above and beyond. Was in touch with my husband and I on a daily basis. Very willing to recommend him to family and friends when they are ready to buy a home."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Very easy to work with. No issue. Will recommend to anyone needing to purchase a home."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "was very easy to work with and stayed in touch for the length of the process. I will recommend him and his team to my friends and family."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "The efforts to make the customer happy is great and very noticeable. I would recommend this to everyone. Great great work and thank you all for helping me and my family"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Everyone that was part of my loan team was great, But was exceptional. He answered every question I had, he put forth extra effort to solve challenging issues that I had with the approval process and he was always pleasant and professional."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "is an outstanding Loan Officer! He and his team are on top of their game and there is no problem too big for them to tackle! At first, was the loan officer for my home. I was so impressed with him, that I refer him to many of"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "is an outstanding Loan Officer! He is on top of his game and there is no problem too big for him to tackle! At first, he was the loan officer for my home. I was so impressed with him, that I refer him to many of my clients. He is"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "is an outstanding Loan Officer! He is on top of his game and there is no problem too big for him to tackle! At first, he was the loan officer for my home. I was so impressed with him, that I refer him to many of my clients. He is"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "is a joy to work with and excellent in customer service put his customers first highly recommend"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Awesome customer service, professionalism and pleasant to work with!"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "They answered all of our questions in a timely fashion."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "and his team were there every step of the way throughout our refinance. They were very prompt in answering any and all questions we had."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "was the best part, only one I dealt with"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Great service and fantastic results!!"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Excellent customer service and great job. The communication is transparent and they follow up with you every date up to do the closing. Thank you"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "very smooth process thank you"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Best Staff Ever. went leaps and bounds out of his way to make me feel comfortable, and guiding me through the process. Highly recommended."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "said he was going to make our loan as pleasant and easy as possible. He did just that. and his staff were extremely professional. I would recommend and Midwest very strongly to anyone who is considering a loan or refinance!"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Easy, felt like it was always being taken care of."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "helped me all through the process. Very Professional and knowledgeable."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Attention to customer service and communication."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "You not giving up on us!"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "The constant communication... via email, phone calls, text messages. really did a great job in understanding our situation, and helped us walk through the process each step of the way. The signing was the only challenging thing to understand,"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "was amazing, honest and always responsive! We had the best experience refinancing our home with him."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "is an absolute gem! He is friendly, fast, and he communicates constantly about the loan process. He has been my go-to mortgage guy for several years now, and as long as he is in the business, I won't depend on anyone else!"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Just wanted to say Thank you to and his team! They helped me tremendously with my refinancing, but they also helped me with my homeowner and vehicle insurancea alsi! I encourage all veterans to reach out to! Also any of my friends"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "We have nothing but wonderful things to say about how professional, helpful and prompt was. The snags we experienced were out of his control and went above and beyond to smooth the process and mitigate the cost. We would recommend"
    },
    {
      "rating": 4.83,
      "who": "Verified borrower",
      "quote": "Working with was great! He is responsive, professional and goes the extra mile. We would without hesitation recommend to our friends. The only negative experience was with the underwriter (out of 's control). Not sure if it"
    },
    {
      "rating": 4.83,
      "who": "Verified borrower",
      "quote": "He was prompt, responsive and very helpful He is a very nice and well mannered gentleman"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "is the best in the industry! So easy to work with and has your best interest in mind."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "was great to work with. He made everything easy and I felt like he had my best interest in mind. I will use him for all my mortgage needs."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Just over all communications with everyone was good, and they were helpful friendly."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "I had a great experience refinancing my house with The process was very easy and if I had any questions was available to help and provide information that would be in my interest. I would suggest to anyone who"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "went above and beyond to get us the best mortgage rate possible. He worked very hard for us and kept up up to date through the process. Thanks for a great experience"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Getting loan completed"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "My home equity loan process was surprisingly smooth with the help of. She was a great educator. Keri is extremely knowledgeable and was a patient Loan Officer with me, one who knew very little about the loan process. She was"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "No hastles everything was on point, quick response to the process, it was a wonderful system and experience. I will recommend this company and individuals to everyone I know. Thank you"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Pleasure to work with. Very professional and easy to deal with. Great guy."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "is the definition of professional. He goes above and beyond in his job. Always a pleasure working with him."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "was awesome, got me closed fast and always communicate with me.. thanks!!!"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "was very responsive and stayed true to his word through the entire process."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "I appreciated that it was easy to readily communicate with. It was great to have all my questions answered and feel that he was always updated and committed to the completion of my Re-finance. Thanks for everything."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "This is the second time I used this company for my home. Very easy process and the highest professional service during process"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "was very pleasant to work with. When there was a question he would answer near immediately. He also gave advise on how to get a lower rate which was greatly appreciated. Would definitely recommend and would work in the future with"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "I felt like treated me like he would like to be treated himself."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "is very helpful and have a good knowledge. He helped me and gave me the right direction."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Excellent customer service"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "I can not say enough about who works here. We refinanced with him. He answered every question we had in a very short time limit. He is extremely knowledgeable. He saved us alot of money after all said and done. I would not hesitate to"
    },
    {
      "rating": 4.17,
      "who": "Verified borrower",
      "quote": "Everything went smoothly"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "From one Mr. was there for us. Any questions he was there to answer them.if you need a honesthardworking and knowledgeable person working on your side to help with your home mortgage is the man you want working for you. Very"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Honest and straight forward communication."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Davids ability to understand my income from different bussiness sources and to be able to get me approved."
    },
    {
      "rating": 4.33,
      "who": "Verified borrower",
      "quote": "Friendly and very determined/dedicated to the task at hand and getting us the best rate possible Thank you!!"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "was a pleasure to work with. He was very prompt in his responses. He would respond into the night. He would respond on weekends. He would go into the office on Saturday's. His communication was just on another level.He was also very knowledgeable."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Great advice and good service. Thanks."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Answered Questions in a timely manner! Returned phone calls in a timely manner! Was a Professional in all of our dealings!"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "I feel lucky to have been given 's name as a referral. He was professional, patience and truly genuine. He kept me very informed at each step in the proceess with understanding and respect. I will highly recommend"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "The extra effort goes to in order make it happen is great. His customer service \\happiness goes above and beyond throughout the entire process."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "The service we received was great. was friendly, helpful and honest."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "was pleasant, helpful and friendly. Communication is very important to me and he kept us up to date from start to finish. I highly recommend."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "made my refinancing easy. Would recommend him and this company to friends and family!"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "was polite, knowledgeable, everything moved along very quickly. I was kept informed the entire time. My refinancing is now complete andmy payment is down nearly $300.00 and the interest was cut in half. I would definitely do business"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "is awesome at what he does. He goes above and beyond for his clients. He is the best of the best. It’s always a pleasure doing business with him."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Excellent rates. Was very communicative throughout the process and made it quick and easy for me."
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "helped me to procure a new loan for my home. His ability and experience was evident when we worked through the process. I really appreciated his tenacity and persistence, he never hesitated to reach out to me when needed. But most"
    },
    {
      "rating": 5,
      "who": "Verified borrower",
      "quote": "Honest, insightful and just a great fiduciary. The kind of guy you want in your corner because he's the kind of guy who does things right and cares."
    }
  ]
}